const CourseGuidelineSection = () => {
  return (
    <section>
      <div className="max-w-6xl mx-auto px-4 space-y-10">
        {/* ===== Card 1 ===== */}
        <div className="bg-[#F7FAF9] border border-[#E1ECEA] rounded-3xl p-6 md:p-8">
          <h2 className="text-lg md:text-xl font-semibold text-text-primary mb-4 flex items-center gap-2">
            <svg
              clip-rule="evenodd"
              fill-rule="evenodd"
              className="w-6 h-6"
              image-rendering="optimizeQuality"
              shape-rendering="geometricPrecision"
              text-rendering="geometricPrecision"
              viewBox="0 0 1707 1707"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M1128 1066c-312 0-564-253-564-564 0 311-253 564-564 564 311 0 564 252 564 563 0-311 252-563 564-563"
                fill="#ffd93b"
              />
              <path
                d="M1707 1357c-171 0-309-139-309-309 0 170-139 309-309 309 170 0 309 138 309 309 0-171 138-309 309-309m-178-940c-208 0-376-168-376-376 0 208-168 376-376 376 208 0 376 168 376 376 0-208 168-376 376-376"
                fill="#ffb030"
              />
            </svg>{" "}
            ৪ ধাপে পূর্ণ রূপান্তর সিস্টেম
          </h2>
          <h3 className="text-lg font-semibold inline-flex items-center gap-2 text-[#0F172B] mb-2">
            <svg
              className="w-6 h-6"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 512.019 512.019"
              preserveAspectRatio="xMidYMid meet"
            >
              <path
                fill="#cfd8dc"
                d="M178.229 376.467 135.562 333.8a10.46 10.46 0 0 0-8.363-3.115 10.67 10.67 0 0 0-7.787 4.267l-117.269 160c-3.535 4.713-2.58 11.399 2.133 14.933a10.67 10.67 0 0 0 12.8 0l160-117.333c4.752-3.481 5.783-10.156 2.302-14.908a11 11 0 0 0-1.064-1.241z"
              />
              <path
                fill="#d32f2f"
                d="M316.895 301.8 210.229 195.134a95.1 95.1 0 0 0-63.019-19.947A110.06 110.06 0 0 0 67.125 205.8c-17.323 17.323-15.531 44.096 5.333 79.595a467 467 0 0 0 69.333 84.821c42.432 42.411 96 86.485 135.04 86.485a39.92 39.92 0 0 0 29.376-11.819c44.416-44.394 33.344-120.404 10.688-143.082"
              />
              <path
                fill="#f44336"
                d="M402.229 216.467 295.562 109.8c-4.165-4.164-10.917-4.164-15.083 0l-85.333 85.333c-13.952 13.952-12.8 44.8 32 89.749 29.248 29.248 52.565 39.893 69.12 39.893a28.3 28.3 0 0 0 20.629-7.893l85.333-85.333c4.165-4.165 4.165-10.917.001-15.082"
              />
              <path
                fill="#d32f2f"
                d="M511.199 187.944a10.67 10.67 0 0 0-9.856-6.592c-23.125 0-73.899-25.003-109.781-60.885s-60.885-86.635-60.885-109.781a10.667 10.667 0 0 0-18.219-7.552c-43.563 43.584-57.173 117.909 10.667 185.749a142.63 142.63 0 0 0 100.693 47.125 120.68 120.68 0 0 0 85.056-36.459 10.67 10.67 0 0 0 2.325-11.605"
              />
              <path
                fill="#f44336"
                d="M444.895 67.134C399.711 21.971 358.858.019 320.01.019c-5.891 0-10.667 4.776-10.667 10.667 0 31.851 30.123 87.872 67.115 124.885s93.056 67.115 124.885 67.115c5.891 0 10.667-4.776 10.667-10.667 0-38.869-21.952-79.723-67.115-124.885"
              />
              <path
                fill="currentColor"
                d="M423.818 236.03a142.6 142.6 0 0 1-100.693-47.125 144.38 144.38 0 0 1-47.104-100.139 119.66 119.66 0 0 1 36.437-85.632A10.67 10.67 0 0 1 320.01.019c38.869 0 79.723 21.952 124.885 67.115s67.115 86.037 67.115 124.885a10.66 10.66 0 0 1-3.115 7.552 120.7 120.7 0 0 1-85.077 36.459M324.426 21.48a97.8 97.8 0 0 0-27.093 67.115 123.73 123.73 0 0 0 40.875 85.205c59.413 59.435 118.315 45.099 152.341 13.781-1.771-31.381-22.187-66.795-60.757-105.365S355.807 23.251 324.426 21.48"
              />
              <path
                fill="currentColor"
                d="M501.343 202.686c-31.829 0-87.851-30.101-124.885-67.115s-67.115-93.035-67.115-124.885c0-5.891 4.776-10.667 10.667-10.667s10.667 4.776 10.667 10.667c0 23.147 25.003 73.92 60.885 109.781s86.656 60.885 109.781 60.885c5.891 0 10.667 4.776 10.667 10.667s-4.776 10.667-10.667 10.667M296.266 324.798c-16.555 0-39.872-10.667-69.12-39.893-44.8-44.8-45.952-75.797-32-89.749l85.333-85.333c4.092-4.237 10.845-4.355 15.083-.262s4.355 10.845.262 15.083q-.129.133-.262.262l-85.333 85.333c-4.267 4.267-2.261 25.323 32 59.584s55.253 36.267 59.584 32l85.333-85.333c4.237-4.093 10.99-3.975 15.083.262a10.666 10.666 0 0 1 0 14.821l-85.333 85.333a28.32 28.32 0 0 1-20.63 7.892"
              />
              <path
                fill="currentColor"
                d="M276.853 456.702c-39.125 0-92.608-44.053-135.04-86.485a467 467 0 0 1-69.269-84.8c-20.885-35.499-22.656-62.293-5.333-79.595a110.44 110.44 0 0 1 79.125-30.635h.875a95.1 95.1 0 0 1 62.976 19.968c4.092 4.237 3.975 10.99-.262 15.083-4.134 3.992-10.687 3.992-14.82 0a77.93 77.93 0 0 0-47.893-13.717h-.832a90.63 90.63 0 0 0-64.171 24.384c-11.947 11.947-1.877 35.797 8.661 53.739a447 447 0 0 0 66.005 80.512c64.427 64.427 115.861 93.013 134.251 74.667 27.952-31.219 32.278-77.016 10.667-112.917-4.092-4.237-3.975-10.99.262-15.083 4.134-3.992 10.687-3.992 14.82 0 22.656 22.677 33.728 98.688-10.667 143.083a39.93 39.93 0 0 1-29.355 11.796"
              />
              <path
                fill="currentColor"
                d="M10.677 512.019c-5.891 0-10.667-4.776-10.667-10.667 0-2.308.749-4.554 2.133-6.4l117.333-160c3.54-4.708 10.227-5.655 14.936-2.115 4.7 3.534 5.653 10.206 2.131 14.915l-76.267 104 104-76.267c4.71-3.539 11.396-2.589 14.935 2.12 3.539 4.71 2.589 11.396-2.12 14.935l-.015.011-160 117.333a10.65 10.65 0 0 1-6.399 2.135"
              />
            </svg>
            মূল বিষয়সমূহ
          </h3>
          <div className="space-y-3 text-[#2E5C57] text-sm md:text-base">
            {[
              "রমজানের আগে – ৭ দিন : নিজের অবস্থা বুঝে নেওয়া (প্রাথমিক মূল্যায়ন)",
              "রমজানের ৩০ দিন : প্রতিদিন মাত্র ১ মিনিটে ইবাদত ও আমল ট্র্যাকিং",
              "রমজানের শেষে : অর্জন ও ঘাটতির হিসাব",
              "রমজানের পর – ৭ দিন : অভ্যাস কন্টিনিউ করার পরিকল্পনা",
            ].map((item, idx) => (
              <div key={idx} className="flex items-start gap-3">
                <span className="mt-1 text-green-600">
                  <svg
                    className="w-6 h-6"
                    clip-rule="evenodd"
                    fill-rule="evenodd"
                    image-rendering="optimizeQuality"
                    shape-rendering="geometricPrecision"
                    text-rendering="geometricPrecision"
                    viewBox="0 0 43.349 43.349"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M18.795 40.467C8.429 40.467.003 32.04.003 21.675S8.429 2.883 18.795 2.883c5.218 0 10.083 2.08 13.68 5.887a.465.465 0 0 1 .045.602l1.103 1.442a.48.48 0 0 1 .65.178c2.186 3.137 3.314 6.84 3.314 10.682 0 10.366-8.426 18.793-18.792 18.793m0-3.879c-8.215 0-14.914-6.699-14.914-14.913S10.58 6.76 18.795 6.76c3.913 0 7.615 1.516 10.4 4.23a.47.47 0 0 1 .044.663l1.396 1.733c.213-.125.508-.113.676.143 6.338 9.646-.54 23.058-12.516 23.058"
                      fill="#545454"
                    />
                    <path
                      d="M19.289 31.335a.5.5 0 0 1-.459-.317c-.035-.07-3.067-7.898-7.756-10.86-.917-.564-1.622-1.163-1.34-2.503.282-1.304 1.163-2.045 2.75-2.397 2.82-.6 5.853 3.772 6.98 5.57 3.95-5.746 11.847-14.772 23.341-15.83.555-.065.76.757.247.987-.176.07-16.606 7.58-23.27 25.068a.56.56 0 0 1-.493.282"
                      fill="#00b42c"
                    />
                  </svg>
                </span>
                <p>{item}</p>
              </div>
            ))}

            <div className="pt-3 text-text-primary text-base font-bold flex items-center gap-2">
              💚 ভিডিও গাইডলাইন একবার দেখলেই পুরো ট্র্যাকার সিস্টেম পরিষ্কার
              হয়ে যাবে।
            </div>
          </div>
        </div>

        {/* ===== Card ===== */}
        <div className="bg-white border border-[#E1ECEA] rounded-3xl p-6 md:p-8">
          <h2 className="text-lg md:text-xl font-semibold text-text-primary mb-6 flex items-center gap-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              className="w-6 h-6"
              viewBox="0 0 24 24"
              fill="none"
            >
              <mask
                id="mask0_541_902"
                style={{ maskType: "alpha" }}
                maskUnits="userSpaceOnUse"
                x="0"
                y="0"
                width="24"
                height="24"
              >
                <rect width="24" height="24" fill="#D9D9D9" />
              </mask>
              <g mask="url(#mask0_541_902)">
                <path
                  d="M7.5 21.72C6.53333 21.72 5.70833 21.3783 5.025 20.695C4.34167 20.0116 4 19.1866 4 18.22V5.21997C4 4.2533 4.34167 3.4283 5.025 2.74497C5.70833 2.06164 6.53333 1.71997 7.5 1.71997H20V16.72C19.5833 16.72 19.2292 16.8658 18.9375 17.1575C18.6458 17.4491 18.5 17.8033 18.5 18.22C18.5 18.6366 18.6458 18.9908 18.9375 19.2825C19.2292 19.5741 19.5833 19.72 20 19.72V21.72H7.5ZM6 15.045C6.23333 14.9283 6.475 14.845 6.725 14.795C6.975 14.745 7.23333 14.72 7.5 14.72H8V3.71997H7.5C7.08333 3.71997 6.72917 3.8658 6.4375 4.15747C6.14583 4.44914 6 4.8033 6 5.21997V15.045ZM10 14.72H18V3.71997H10V14.72ZM7.5 19.72H16.825C16.725 19.4866 16.6458 19.2491 16.5875 19.0075C16.5292 18.7658 16.5 18.5033 16.5 18.22C16.5 17.9533 16.525 17.695 16.575 17.445C16.625 17.195 16.7083 16.9533 16.825 16.72H7.5C7.06667 16.72 6.70833 16.8658 6.425 17.1575C6.14167 17.4491 6 17.8033 6 18.22C6 18.6533 6.14167 19.0116 6.425 19.295C6.70833 19.5783 7.06667 19.72 7.5 19.72Z"
                  fill="#1C1B1F"
                />
              </g>
            </svg>{" "}
            কীভাবে ব্যবহার করবেন?
          </h2>

          <div className="space-y-3">
            {[
              "প্রতিদিন নির্দিষ্ট সময়ে ট্র্যাকার বই খুলুন",
              "আজকের ইবাদত ও আমল চিহ্নিত করুন",
              "নিজের অনুভূতি লিখুন",
              "পরবর্তী দিনের ছোট লক্ষ্য ঠিক করুন",
            ].map((step, idx) => (
              <div
                key={idx}
                className="flex items-center gap-3 bg-[#F1F7F6] border border-[#E1ECEA] rounded-xl px-4 py-3 text-[#2E5C57] text-sm md:text-base"
              >
                <span className="w-6 h-6 flex items-center justify-center rounded-full bg-[#2F7C74] text-white text-xs">
                  <svg
                    className="w-6 h-6"
                    viewBox="0 0 30 30"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="m10.334 15.667 2.667 2.667 6.666-6.667"
                      stroke="#fff"
                      stroke-width="1.667"
                      stroke-linecap="round"
                      stroke-linejoin="round"
                    />
                  </svg>
                </span>
                <p>{step}</p>
              </div>
            ))}
          </div>

          <p className="mt-5 text-text-primary text-base font-bold flex items-center gap-2">
            💚 একদিন নয়—৩০ দিন। পরিবর্তন আসবেই
          </p>
        </div>

        {/* ===== Bottom CTA ===== */}
        <div className="bg-[#123F3A] rounded-3xl p-8 text-center text-white shadow-lg">
          <h3 className="text-lg md:text-xl font-semibold mb-2">
            ভিডিও দেখে নিলেন?
          </h3>
          <p className="text-sm md:text-base text-[#CFE7E4] mb-4">
            এখন ট্র্যাকার বই খুলে আজ থেকেই শুরু করুন
          </p>
          <p className="text-sm md:text-base font-medium text-[#E6FFFB]">
            ✨ "রমজান দ্রুত চলে যায়... কিন্তু রমজানে গড়া অভ্যাস সারাজীবন থাকে"
          </p>
        </div>
      </div>
    </section>
  );
};

export default CourseGuidelineSection;
