export interface FAQ {
  id: number;
  question: string;
  answer: string;
}

export const faqs: FAQ[] = [
  {
    id: 1,
    question: "আমি কি যেকোনো সময় শুরু করতে পারি?",
    answer:
      "হ্যাঁ, আপনি যেকোনো সময় কোর্সে যোগদান করতে পারেন এবং আপনার নিজস্ব গতিতে এগিয়ে যেতে পারেন।",
  },
  {
    id: 2,
    question: "কোর্সগুলি কত দীর্ঘ?",
    answer:
      "কোর্সের দৈর্ঘ্য কোর্সভেদে পরিবর্তিত হয়, তবে বেশিরভাগ কোর্স কয়েক সপ্তাহ থেকে কয়েক মাস পর্যন্ত স্থায়ী হয়।",
  },
  {
    id: 3,
    question: "আমি কি কোর্সের সামগ্রীতে আজীবন অ্যাক্সেস পাব?",
    answer:
      "হ্যাঁ। একবার নিবন্ধন করলে, আপনি কোর্সের সামগ্রীতে জীবনসংগতভাবে অ্যাক্সেস পাবেন।",
  },
  {
    id: 4,
    question: "কোর্সের পেমেন্ট মেথডগুলি কী কী?",
    answer: "বর্তমানে bKash সমর্থিত। আরও গেটওয়েগুলি শীঘ্রই যোগ হবে।",
  },
];
